      ******************************************************************
      *
      * COPY CODIGO PAISES
      * LONGITUD(52)
      *
      ******************************************************************
           01 ITPAIS-REG.
              03 ITPAIS-CODIGO    PIC X(2).
              03 ITPAIS-DESCR     PIC X(50).
