      ******************************************************************
      *
      * COPY URL
      * LONGITUD(76)
      *
      *
      ******************************************************************
           01 URL-REG.
              03 URL-URL            PIC X(50).
              03 URL-USUARIO        PIC X(08).
              03 URL-FECHA          PIC X(10).
              03 URL-HORA           PIC X(08).
